***Creating Series***

In [5]:
import pandas as pd
import numpy as np

In [179]:
pd.__version__

'2.2.3'

In [181]:
#series through list
lst = [1,2,3,4,5]
print(lst)
pd.Series(lst)

[1, 2, 3, 4, 5]

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [183]:
#series through numpy array
arr = np.array([1,2,3,4,5])
pd.Series(arr)

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [185]:
pd.Series(data = ["Rajnish", "Chandu", "Aditi", "Kashish"], index = [1,2,3,4])

1    Rajnish
2     Chandu
3      Aditi
4    Kashish
dtype: object

In [187]:
#series through dictionary values
run_km = {"day1":400,"day_2":300, "day3":1200}
pd.Series(run_km)

day1      400
day_2     300
day3     1200
dtype: int64

In [189]:
#using repeat function using along with creating a series
print(pd.Series(5).repeat(7))

0    5
0    5
0    5
0    5
0    5
0    5
0    5
dtype: int64

In [191]:
print(pd.Series(5).repeat(7).reset_index())

   index  0
0      0  5
1      0  5
2      0  5
3      0  5
4      0  5
5      0  5
6      0  5

In [193]:
print(pd.Series([10,20]).repeat([5.4]).reset_index())

   index   0
0      0  10
1      0  10
2      0  10
3      0  10
4      0  10
5      1  20
6      1  20
7      1  20
8      1  20
9      1  20

In [195]:
df = pd.Series([10,20]).repeat([5.4]).reset_index(drop = True)
df

0    10
1    10
2    10
3    10
4    10
5    20
6    20
7    20
8    20
9    20
dtype: int64

In [197]:
#Accessing Elements
print(df[1])
print('-'*40)
print(df[2])
print('-'*40)
print(df[5])

10
----------------------------------------
10
----------------------------------------
20

In [199]:
print(df[:])
print('-'*40)
print(df[1:-1])

0    10
1    10
2    10
3    10
4    10
5    20
6    20
7    20
8    20
9    20
dtype: int64
----------------------------------------
1    10
2    10
3    10
4    10
5    20
6    20
7    20
8    20
dtype: int64

***Aggregate Functions on Pandas Series***

In [202]:
sr = pd.Series([1,2,3,4,5,6,7])
print(sr)
print('-'*40)
print(sr.agg([min,max,sum]))

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64
----------------------------------------
min     1
max     7
sum    28
dtype: int64

C:\Users\chand\AppData\Local\Temp\ipykernel_20992\3125075588.py:4: FutureWarning: The provided callable <built-in function min> is currently using Series.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  print(sr.agg([min,max,sum]))
C:\Users\chand\AppData\Local\Temp\ipykernel_20992\3125075588.py:4: FutureWarning: The provided callable <built-in function max> is currently using Series.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  print(sr.agg([min,max,sum]))
C:\Users\chand\AppData\Local\Temp\ipykernel_20992\3125075588.py:4: FutureWarning: The provided callable <built-in function sum> is currently using Series.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  print(sr.agg([min,max,sum]))

***Series Absolute Function***

In [205]:
sr = pd.Series([1, -2, 3, -4, -5, 6])
sr1 = pd.Series([1, 2, 3, 4, 5, 6])
result = pd.concat([sr, sr1], ignore_index=True)
print(result)

0     1
1    -2
2     3
3    -4
4    -5
5     6
6     1
7     2
8     3
9     4
10    5
11    6
dtype: int64

***Astype function***

In [208]:
type(sr1[0])

numpy.int64

In [210]:
sr1.astype('float')

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
dtype: float64

***Between Function***

In [213]:
sr1 = pd.Series([1,2,30,4,5,6,7,8,9,20])
print(sr1)

0     1
1     2
2    30
3     4
4     5
5     6
6     7
7     8
8     9
9    20
dtype: int64

In [215]:
sr1.between(5,7)

0    False
1    False
2    False
3    False
4     True
5     True
6     True
7    False
8    False
9    False
dtype: bool

In [217]:
sr1.between(10,50)

0    False
1    False
2     True
3    False
4    False
5    False
6    False
7    False
8    False
9     True
dtype: bool

***All String Functions can be used to Extract or Modify texts in a series***

*Upper and Lower Functions, 
Len function, 
Strip function, 
Contains Function, 
Replace Function, 
Count Function, 
Startswith and Endswith function, 
Find function*

In [221]:
ser = pd.Series(["  Chandini Gujju ", " Rajnish Kumar  ", "  Aditi Gupta ", " Kaviya G  ", "  Kashsih Pratap "])

In [223]:
print(ser.str.upper())

0      CHANDINI GUJJU
1      RAJNISH KUMAR
2         ADITI GUPTA
3           KAVIYA G
4      KASHSIH PRATAP
dtype: object

In [225]:
print(ser.str.lower())

0      chandini gujju
1      rajnish kumar
2         aditi gupta
3           kaviya g
4      kashsih pratap
dtype: object

In [227]:
print(ser.str.title())

0      Chandini Gujju
1      Rajnish Kumar
2         Aditi Gupta
3           Kaviya G
4      Kashsih Pratap
dtype: object

In [229]:
print(ser.str.capitalize())

0      chandini gujju
1      rajnish kumar
2         aditi gupta
3           kaviya g
4      kashsih pratap
dtype: object

In [231]:
print(ser.str.len())
print('-'*40)
for i in ser:
    print(len(i))

0    17
1    16
2    14
3    11
4    17
dtype: int64
----------------------------------------
17
16
14
11
17

In [233]:
ser = ser.str.strip() #removes unwanted space
print(ser.str.len())

0    14
1    13
2    11
3     8
4    14
dtype: int64

In [235]:
ser.str.split()  #used to split

0    [Chandini, Gujju]
1     [Rajnish, Kumar]
2       [Aditi, Gupta]
3          [Kaviya, G]
4    [Kashsih, Pratap]
dtype: object

In [237]:
ser.str.split()[0]

['Chandini', 'Gujju']

In [239]:
ser.str.split()[1]

['Rajnish', 'Kumar']

In [241]:
ser = pd.Series(["Chandini Gujju", "Rajnish Kumar", "Aditi Gupta", "Kaviya G", "Kashsih Pratap"])

In [243]:
ser.str.contains("G")

0     True
1    False
2     True
3     True
4    False
dtype: bool

In [245]:
ser = ser.str.replace("Chandini","Chandrika")

In [247]:
ser

0    Chandrika Gujju
1      Rajnish Kumar
2        Aditi Gupta
3           Kaviya G
4     Kashsih Pratap
dtype: object

In [249]:
ser.str.count('a')

0    2
1    2
2    1
3    2
4    3
dtype: int64

In [251]:
ser.str.startswith('R')

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [253]:
ser.str.endswith("ju")

0     True
1    False
2    False
3    False
4    False
dtype: bool

In [255]:
ser.str.find("an")

0    2
1   -1
2   -1
3   -1
4   -1
dtype: int64

***Converting a Series to List***

In [258]:
ser = ser.to_list()

In [260]:
print(ser)
print('-'*40)
print(type(ser))

['Chandrika Gujju', 'Rajnish Kumar', 'Aditi Gupta', 'Kaviya G', 'Kashsih Pratap']
----------------------------------------
<class 'list'>

***Detailed Coding Implementation on Pandas DataFrame***

***Creating Data Frames***

In [264]:
#creating a dataframe using list
lst = ['Geeks', 'For', 'Geeks', 'is', 'portal', 'for', 'Geeks']
pd.DataFrame(lst)

        0
0   Geeks
1     For
2   Geeks
3      is
4  portal
5     for
6   Geeks

In [266]:
lst = [['tom',10],['jerry',20],['spike',30]]
print(lst)
print('-'*40)
print(pd.DataFrame(lst))

[['tom', 10], ['jerry', 20], ['spike', 30]]
----------------------------------------
       0   1
0    tom  10
1  jerry  20
2  spike  30

***Creating DataFrame from dict of ndarray/lists***

In [273]:
data = {'Name':['Chandini', 'Rajnish', 'Aditi'], 'Age':[21, 21, 20], 'Qualification':['Data Science','Machine Learning','Data Science']}
print(data)
print('-'*40)
df = pd.DataFrame(data)
print(df)
print('-'*40)
print(df[['Name', 'Age']])

{'Name': ['Chandini', 'Rajnish', 'Aditi'], 'Age': [21, 21, 20], 'Qualification': ['Data Science', 'Machine Learning', 'Data Science']}
----------------------------------------
       Name  Age     Qualification
0  Chandini   21      Data Science
1   Rajnish   21  Machine Learning
2     Aditi   20      Data Science
----------------------------------------
       Name  Age
0  Chandini   21
1   Rajnish   21
2     Aditi   20

***Slicing in DataFrame using iloc and loc***

In [276]:
data = {'One' : pd.Series([1,2,3,4]),
        'Two' : pd.Series([10,20,30,40]),
        'Three' : pd.Series([100,200,300,400]),
        'Four' : pd.Series([1000,2000,3000,4000])}
df = pd.DataFrame(data)
print(df)

   One  Two  Three  Four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [278]:
df.loc[1:2]

   One  Two  Three  Four
1    2   20    200  2000
2    3   30    300  3000

In [282]:
df.loc[2:3]

   One  Two  Three  Four
2    3   30    300  3000
3    4   40    400  4000

In [298]:
df.loc[1:2, 'Two':'Three']

   Two  Three
1   20    200
2   30    300

In [296]:
df.iloc[1:2, 1:4]

   Two  Three  Four
1   20    200  2000

In [304]:
df.iloc[1:-1,1:-1]

   Two  Three
1   20    200
2   30    300

In [306]:
df.iloc[[0,2],[1,3]]

   Two  Four
0   10  1000
2   30  3000

***Slicing Using Conditions***

In [315]:
df[df['Two'] > 20]

   One  Two  Three  Four
2    3   30    300  3000
3    4   40    400  4000

In [319]:
df.loc[df['Two'] > 20, ['Three', 'Four']]

   Three  Four
2    300  3000
3    400  4000

***Column Addition in DataFrame***

In [324]:
l = [10000,20000,30000,40000]
df['Five'] = l;
df

   One  Two  Three  Four   Five
0    1   10    100  1000  10000
1    2   20    200  2000  20000
2    3   30    300  3000  30000
3    4   40    400  4000  40000

In [326]:
l = [100000,200000,300000,400000]
df['Six'] = l;
df

   One  Two  Three  Four   Five     Six
0    1   10    100  1000  10000  100000
1    2   20    200  2000  20000  200000
2    3   30    300  3000  30000  300000
3    4   40    400  4000  40000  400000

In [328]:
df['Seven'] = df['One']+10
df

   One  Two  Three  Four   Five     Six  Seven
0    1   10    100  1000  10000  100000     11
1    2   20    200  2000  20000  200000     12
2    3   30    300  3000  30000  300000     13
3    4   40    400  4000  40000  400000     14

***Column Deletion in DataFrame***

using del (or) using drop

In [332]:
del df['Six']
df

   One  Two  Three  Four   Five  Seven
0    1   10    100  1000  10000     11
1    2   20    200  2000  20000     12
2    3   30    300  3000  30000     13
3    4   40    400  4000  40000     14

In [334]:
df.pop('Seven')
df

   One  Two  Three  Four   Five
0    1   10    100  1000  10000
1    2   20    200  2000  20000
2    3   30    300  3000  30000
3    4   40    400  4000  40000

***Addition of Rows***

In [345]:
df1 = pd.DataFrame([[1,2],[3,4]], columns = ['a','b'])
df2 = pd.DataFrame([[5,6],[7,8]], columns = ['a','b'])
result = pd.concat([df1, df2], ignore_index=True)
result

   a  b
0  1  2
1  3  4
2  5  6
3  7  8

***Pandas drop Function***

In [350]:
data = {'One' : pd.Series([1,2,3,4]),
        'Two' : pd.Series([10,20,30,40]),
        'Three' : pd.Series([100,200,300,400]),
        'Four' : pd.Series([1000,2000,3000,4000])}
df = pd.DataFrame(data)
df
# axis = 0 --> row wise
# axis = 1 --> column wise

   One  Two  Three  Four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [364]:
df.drop([0, 1], axis=0, inplace=True, errors='ignore')

In [366]:
print(df)

   One  Two  Three  Four
2    3   30    300  3000
3    4   40    400  4000

***Transposing a DataFrame***

In [369]:
data = {'One' : pd.Series([1,2,3,4]),
        'Two' : pd.Series([10,20,30,40]),
        'Three' : pd.Series([100,200,300,400]),
        'Four' : pd.Series([1000,2000,3000,4000])}
df = pd.DataFrame(data)
df

   One  Two  Three  Four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [371]:
df.T

          0     1     2     3
One       1     2     3     4
Two      10    20    30    40
Three   100   200   300   400
Four   1000  2000  3000  4000

***More DataFrame Functionalities***

In [374]:
df

   One  Two  Three  Four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [376]:
df.axes

[RangeIndex(start=0, stop=4, step=1),
 Index(['One', 'Two', 'Three', 'Four'], dtype='object')]

In [378]:
df.ndim

2

In [382]:
df.dtypes

One      int64
Two      int64
Three    int64
Four     int64
dtype: object

In [384]:
df.shape

(4, 4)

In [388]:
df.head(2)

   One  Two  Three  Four
0    1   10    100  1000
1    2   20    200  2000

In [390]:
df.tail(2)

   One  Two  Three  Four
2    3   30    300  3000
3    4   40    400  4000

In [394]:
df.empty

False

***Statistical or Mathematical Functions***

sum, mean, median, mode, variance, min, max, standard deviation

In [399]:
data = {'One' : pd.Series([1,2,3,4]),
        'Two' : pd.Series([10,20,30,40]),
        'Three' : pd.Series([100,200,300,400]),
        'Four' : pd.Series([1000,2000,3000,4000])}

In [401]:
df = pd.DataFrame(data)
df

   One  Two  Three  Four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [403]:
df.sum()

One         10
Two        100
Three     1000
Four     10000
dtype: int64

In [405]:
df.mean()

One         2.5
Two        25.0
Three     250.0
Four     2500.0
dtype: float64

In [407]:
df.min()

One         1
Two        10
Three     100
Four     1000
dtype: int64

In [409]:
df.max()

One         4
Two        40
Three     400
Four     4000
dtype: int64

In [411]:
df.var()

One      1.666667e+00
Two      1.666667e+02
Three    1.666667e+04
Four     1.666667e+06
dtype: float64

In [413]:
df.std()

One         1.290994
Two        12.909944
Three     129.099445
Four     1290.994449
dtype: float64

In [415]:
df.median()

One         2.5
Two        25.0
Three     250.0
Four     2500.0
dtype: float64

In [423]:
de = pd.DataFrame({"A":[1,2,2,3,4,4,4,5], "B":[10,20,20,20,30,40,50,30]})
print(de['A'].mode())
print(de['B'].mode())

0    4
Name: A, dtype: int64
0    20
Name: B, dtype: int64

***Describe Function***

In [426]:
data = {'One' : pd.Series([1,2,3,4]),
        'Two' : pd.Series([10,20,30,40]),
        'Three' : pd.Series([100,200,300,400]),
        'Four' : pd.Series([1000,2000,3000,4000])}
df = pd.DataFrame(data)
df

   One  Two  Three  Four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [428]:
df.describe()

            One        Two       Three         Four
count  4.000000   4.000000    4.000000     4.000000
mean   2.500000  25.000000  250.000000  2500.000000
std    1.290994  12.909944  129.099445  1290.994449
min    1.000000  10.000000  100.000000  1000.000000
25%    1.750000  17.500000  175.000000  1750.000000
50%    2.500000  25.000000  250.000000  2500.000000
75%    3.250000  32.500000  325.000000  3250.000000
max    4.000000  40.000000  400.000000  4000.000000

***Pipe Function***

In [7]:
data = {'One' : pd.Series([1,2,3,4]),
        'Two' : pd.Series([10,20,30,40]),
        'Three' : pd.Series([100,200,300,400]),
        'Four' : pd.Series([1000,2000,3000,4000])}
df = pd.DataFrame(data)
df

   One  Two  Three  Four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [9]:
def add_(i,j):
    return i+j
def sub_(i,j):
    return i-j

In [11]:
df.pipe(add_,10)

   One  Two  Three  Four
0   11   20    110  1010
1   12   30    210  2010
2   13   40    310  3010
3   14   50    410  4010

In [15]:
df.pipe(sub_,1)

   One  Two  Three  Four
0    0    9     99   999
1    1   19    199  1999
2    2   29    299  2999
3    3   39    399  3999

In [21]:
def mean_(col):
    return col.mean()
def square(i):
    return i**2
df.pipe(mean_).pipe(square)

One            6.25
Two          625.00
Three      62500.00
Four     6250000.00
dtype: float64

In [25]:
df.pipe(square)

   One   Two   Three      Four
0    1   100   10000   1000000
1    4   400   40000   4000000
2    9   900   90000   9000000
3   16  1600  160000  16000000

***Apply Function***

In [28]:
data = {'One' : pd.Series([1,2,3,4]),
        'Two' : pd.Series([10,20,30,40]),
        'Three' : pd.Series([100,200,300,400]),
        'Four' : pd.Series([1000,2000,3000,4000])}
df = pd.DataFrame(data)
df

   One  Two  Three  Four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [30]:
df.apply(np.mean) #appply uses to apply a  function on whole data frame

One         2.5
Two        25.0
Three     250.0
Four     2500.0
dtype: float64

In [34]:
df.apply(np.sum)

One         10
Two        100
Three     1000
Four     10000
dtype: int64

In [36]:
df.apply(np.max)

One         4
Two        40
Three     400
Four     4000
dtype: int64

In [38]:
df.apply(lambda x:x.max()-x.min())

One         3
Two        30
Three     300
Four     3000
dtype: int64

***Apply map Function***

In [42]:
df.applymap(lambda x:x*100)

C:\Users\chand\AppData\Local\Temp\ipykernel_3464\1004646656.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(lambda x:x*100)

   One   Two  Three    Four
0  100  1000  10000  100000
1  200  2000  20000  200000
2  300  3000  30000  300000
3  400  4000  40000  400000

In [52]:
df = pd.DataFrame({'A':[1.0,2,3,4,5,6],
                  'B':[7.2,8,9.0,1,2.6,3]})
print(df)
print('-'*40)
df1 = df.applymap(np.int64)
print(df1)
print('-'*40)
df2 = df.apply(lambda row : row.mean(),axis=1)
print(df2)

     A    B
0  1.0  7.2
1  2.0  8.0
2  3.0  9.0
3  4.0  1.0
4  5.0  2.6
5  6.0  3.0
----------------------------------------
   A  B
0  1  7
1  2  8
2  3  9
3  4  1
4  5  2
5  6  3
----------------------------------------
0    4.1
1    5.0
2    6.0
3    2.5
4    3.8
5    4.5
dtype: float64

C:\Users\chand\AppData\Local\Temp\ipykernel_3464\883909287.py:5: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df1 = df.applymap(np.int64)

***Reindex Function***

In [67]:
data = {'One' : pd.Series([1,2,3,4]),
        'Two' : pd.Series([10,20,30,40]),
        'Three' : pd.Series([100,200,300,400]),
        'Four' : pd.Series([1000,2000,3000,4000])}
df = pd.DataFrame(data)
print(df)
print('-'*40)
print(df.reindex([2,0,1,3])) #foe rows
print('-'*40)
print(df.reindex(columns = ['Two','One']))

   One  Two  Three  Four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000
----------------------------------------
   One  Two  Three  Four
2    3   30    300  3000
0    1   10    100  1000
1    2   20    200  2000
3    4   40    400  4000
----------------------------------------
   Two  One
0   10    1
1   20    2
2   30    3
3   40    4

***Renaming Columns in Pandas DataFrame***

In [84]:
print(df.rename(columns={'One':'one', 'Two':'two', 'Three':'three','Four':'four'},
               index={0:'a',1:'b',2:'c',3:'d'}))

   one  two  three  four
a    1   10    100  1000
b    2   20    200  2000
c    3   30    300  3000
d    4   40    400  4000

In [93]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

***Sorting in Pandas DataFrame***

In [95]:
#sort in specific order
df.sort_values(by = 'one')

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [97]:
df.sort_values(by = 'one', ascending = False)

   one  two  three  four
3    4   40    400  4000
2    3   30    300  3000
1    2   20    200  2000
0    1   10    100  1000

In [99]:
#sort in specific order with multiple columns
df.sort_values(by=['one', 'two'])

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [101]:
#sort values using specific sort function"
df.sort_values(by=['one'], kind ='heapsort')

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

***Groupby Function***

In [224]:
cricket = {'Teams':['India','India','Australia','SA','SA','SA','SA','NZ','NZ','NZ','India'],
           'Rank':[2,3,4,5,6,7,8,9,10,11,12],
           'Year':[2002,2003,1992,1994,2004,2005,2006,2007,2008,2009,2010],
           'Points':[876,768,889,674,234,678,677,987,967,239,679]}
df = pd.DataFrame(cricket)
df

        Teams  Rank  Year  Points
0       India     2  2002     876
1       India     3  2003     768
2   Australia     4  1992     889
3          SA     5  1994     674
4          SA     6  2004     234
5          SA     7  2005     678
6          SA     8  2006     677
7          NZ     9  2007     987
8          NZ    10  2008     967
9          NZ    11  2009     239
10      India    12  2010     679

In [226]:
df1 = df.groupby('Teams').groups
print(df1)

{'Australia': [2], 'India': [0, 1, 10], 'NZ': [7, 8, 9], 'SA': [3, 4, 5, 6]}

In [228]:
#search for specific country with specific year
df.groupby(['Teams','Year']).get_group(('SA',2004))

  Teams  Rank  Year  Points
4    SA     6  2004     234

In [230]:
#if data is not present then we will be getting an error
df.groupby('Teams')['Points'].sum()

Teams
Australia     889
India        2323
NZ           2193
SA           2263
Name: Points, dtype: int64

In [232]:
df.groupby('Teams')['Points'].sum().sort_values(ascending = False)

Teams
India        2323
SA           2263
NZ           2193
Australia     889
Name: Points, dtype: int64

In [234]:
groups = df.groupby('Teams')['Points']
result = groups.agg([
    np.sum, 
    np.mean, 
    np.var, 
    np.std, 
    np.max, 
    np.min, 
])

result

C:\Users\chand\AppData\Local\Temp\ipykernel_3464\3953335731.py:2: FutureWarning: The provided callable <function sum at 0x000001962AC95B20> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  result = groups.agg([
C:\Users\chand\AppData\Local\Temp\ipykernel_3464\3953335731.py:2: FutureWarning: The provided callable <function mean at 0x000001962AC96C00> is currently using SeriesGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  result = groups.agg([
C:\Users\chand\AppData\Local\Temp\ipykernel_3464\3953335731.py:2: FutureWarning: The provided callable <function var at 0x000001962AC96E80> is currently using SeriesGroupBy.var. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "var" instead.
  result = groups.agg([
C:\Users\chand\AppData\Local\Temp\ipykernel_3464\3953335731.py:2: FutureWarning: The provided callable <function std at 0x000001962AC96D40> is currently using SeriesGroupBy.std. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "std" instead.
  result = groups.agg([
C:\Users\chand\AppData\Local\Temp\ipykernel_3464\3953335731.py:2: FutureWarning: The provided callable <function max at 0x000001962AC96200> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  result = groups.agg([
C:\Users\chand\AppData\Local\Temp\ipykernel_3464\3953335731.py:2: FutureWarning: The provided callable <function min at 0x000001962AC96340> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  result = groups.agg([

            sum        mean            var         std  max  min
Teams
Australia   889  889.000000            NaN         NaN  889  889
India      2323  774.333333    9732.333333   98.652589  876  679
NZ         2193  731.000000  181648.000000  426.201830  987  239
SA         2263  565.750000   48917.583333  221.173198  678  234

In [236]:
df.groupby('Teams').filter(lambda x:len(x)==3)

    Teams  Rank  Year  Points
0   India     2  2002     876
1   India     3  2003     768
7      NZ     9  2007     987
8      NZ    10  2008     967
9      NZ    11  2009     239
10  India    12  2010     679

***Working With CSV***

In [259]:
df = pd.read_csv("Synthetic_Financial_datasets_log.csv")

In [240]:
df.head()

,step,type,amount,nameOrig,oldbalanceOrg,newbalanceOrig,nameDest,oldbalanceDest,newbalanceDest,isFraud,isFlaggedFraud
0,1,PAYMENT,9839.64,C1231006815,170136.0,160296.36,M1979787155,0.0,0.0,0,0
1,1,PAYMENT,1864.28,C1666544295,21249.0,19384.72,M2044282225,0.0,0.0,0,0
2,1,TRANSFER,181.00,C1305486145,181.0,0.00,C553264065,0.0,0.0,1,0
3,1,CASH_OUT,181.00,C840083671,181.0,0.00,C38997010,21182.0,0.0,1,0
4,1,PAYMENT,11668.14,C2048537720,41554.0,29885.86,M1230701703,0.0,0.0,0,0

In [241]:
df.tail()

,step,type,amount,nameOrig,oldbalanceOrg,newbalanceOrig,nameDest,oldbalanceDest,newbalanceDest,isFraud,isFlaggedFraud
6362615,743,CASH_OUT,339682.13,C786484425,339682.13,0.0,C776919290,0.00,339682.13,1,0
6362616,743,TRANSFER,6311409.28,C1529008245,6311409.28,0.0,C1881841831,0.00,0.00,1,0
6362617,743,CASH_OUT,6311409.28,C1162922333,6311409.28,0.0,C1365125890,68488.84,6379898.11,1,0
6362618,743,TRANSFER,850002.52,C1685995037,850002.52,0.0,C2080388513,0.00,0.00,1,0
6362619,743,CASH_OUT,850002.52,C1280323807,850002.52,0.0,C873221189,6510099.11,7360101.63,1,0

In [242]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6362620 entries, 0 to 6362619
Data columns (total 11 columns):
 #   Column          Dtype
---  ------          -----
 0   step            int64
 1   type            object
 2   amount          float64
 3   nameOrig        object
 4   oldbalanceOrg   float64
 5   newbalanceOrig  float64
 6   nameDest        object
 7   oldbalanceDest  float64
 8   newbalanceDest  float64
 9   isFraud         int64
 10  isFlaggedFraud  int64
dtypes: float64(5), int64(3), object(3)
memory usage: 534.0+ MB

In [243]:
#isnull --> function to check if there are nan values present
df.isnull()

,step,type,amount,nameOrig,oldbalanceOrg,newbalanceOrig,nameDest,oldbalanceDest,newbalanceDest,isFraud,isFlaggedFraud
0,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...
6362615,False,False,False,False,False,False,False,False,False,False,False
6362616,False,False,False,False,False,False,False,False,False,False,False
6362617,False,False,False,False,False,False,False,False,False,False,False
6362618,False,False,False,False,False,False,False,False,False,False,False
6362619,False,False,False,False,False,False,False,False,False,False,False

In [244]:
df.isnull().sum()

step              0
type              0
amount            0
nameOrig          0
oldbalanceOrg     0
newbalanceOrig    0
nameDest          0
oldbalanceDest    0
newbalanceDest    0
isFraud           0
isFlaggedFraud    0
dtype: int64

In [245]:
#Quantile --> function to get specific percentile value
df.describe(percentiles=[.80])

,step,amount,oldbalanceOrg,newbalanceOrig,oldbalanceDest,newbalanceDest,isFraud,isFlaggedFraud
count,6.362620e+06,6.362620e+06,6.362620e+06,6.362620e+06,6.362620e+06,6.362620e+06,6.362620e+06,6.362620e+06
mean,2.433972e+02,1.798619e+05,8.338831e+05,8.551137e+05,1.100702e+06,1.224996e+06,1.290820e-03,2.514687e-06
std,1.423320e+02,6.038582e+05,2.888243e+06,2.924049e+06,3.399180e+06,3.674129e+06,3.590480e-02,1.585775e-03
min,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
50%,2.390000e+02,7.487194e+04,1.420800e+04,0.000000e+00,1.327057e+05,2.146614e+05,0.000000e+00,0.000000e+00
80%,3.550000e+02,2.466112e+05,1.986320e+05,2.467081e+05,1.322204e+06,1.517363e+06,0.000000e+00,0.000000e+00
max,7.430000e+02,9.244552e+07,5.958504e+07,4.958504e+07,3.560159e+08,3.561793e+08,1.000000e+00,1.000000e+00

In [246]:
df['amount'].quantile(.80)

246611.22000000006

In [247]:
df['amount'].quantile(.99)

1615979.4715999917

In [248]:
#Copy Function
de = df.copy()

In [249]:
de.head(3)

,step,type,amount,nameOrig,oldbalanceOrg,newbalanceOrig,nameDest,oldbalanceDest,newbalanceDest,isFraud,isFlaggedFraud
0,1,PAYMENT,9839.64,C1231006815,170136.0,160296.36,M1979787155,0.0,0.0,0,0
1,1,PAYMENT,1864.28,C1666544295,21249.0,19384.72,M2044282225,0.0,0.0,0,0
2,1,TRANSFER,181.00,C1305486145,181.0,0.00,C553264065,0.0,0.0,1,0

In [250]:
de['amount+100'] = de['amount']+100
de.head(5)

,step,type,amount,nameOrig,oldbalanceOrg,newbalanceOrig,nameDest,oldbalanceDest,newbalanceDest,isFraud,isFlaggedFraud,amount+100
0,1,PAYMENT,9839.64,C1231006815,170136.0,160296.36,M1979787155,0.0,0.0,0,0,9939.64
1,1,PAYMENT,1864.28,C1666544295,21249.0,19384.72,M2044282225,0.0,0.0,0,0,1964.28
2,1,TRANSFER,181.00,C1305486145,181.0,0.00,C553264065,0.0,0.0,1,0,281.00
3,1,CASH_OUT,181.00,C840083671,181.0,0.00,C38997010,21182.0,0.0,1,0,281.00
4,1,PAYMENT,11668.14,C2048537720,41554.0,29885.86,M1230701703,0.0,0.0,0,0,11768.14

In [251]:
df.head()

,step,type,amount,nameOrig,oldbalanceOrg,newbalanceOrig,nameDest,oldbalanceDest,newbalanceDest,isFraud,isFlaggedFraud
0,1,PAYMENT,9839.64,C1231006815,170136.0,160296.36,M1979787155,0.0,0.0,0,0
1,1,PAYMENT,1864.28,C1666544295,21249.0,19384.72,M2044282225,0.0,0.0,0,0
2,1,TRANSFER,181.00,C1305486145,181.0,0.00,C553264065,0.0,0.0,1,0
3,1,CASH_OUT,181.00,C840083671,181.0,0.00,C38997010,21182.0,0.0,1,0
4,1,PAYMENT,11668.14,C2048537720,41554.0,29885.86,M1230701703,0.0,0.0,0,0

In [252]:
#Value Count Functions
df['type'].value_counts()

type
CASH_OUT    2237500
PAYMENT     2151495
CASH_IN     1399284
TRANSFER     532909
DEBIT         41432
Name: count, dtype: int64

In [253]:
#Unique and Nunique functions
df['type'].unique() #gives unique types

array(['PAYMENT', 'TRANSFER', 'CASH_OUT', 'DEBIT', 'CASH_IN'],
      dtype=object)

In [254]:
df['type'].nunique() #gives no.of unique types

5

In [255]:
#dropna() function
df.isnull().sum()

step              0
type              0
amount            0
nameOrig          0
oldbalanceOrg     0
newbalanceOrig    0
nameDest          0
oldbalanceDest    0
newbalanceDest    0
isFraud           0
isFlaggedFraud    0
dtype: int64

In [256]:
df = df.dropna()
df

,step,type,amount,nameOrig,oldbalanceOrg,newbalanceOrig,nameDest,oldbalanceDest,newbalanceDest,isFraud,isFlaggedFraud
0,1,PAYMENT,9839.64,C1231006815,170136.00,160296.36,M1979787155,0.00,0.00,0,0
1,1,PAYMENT,1864.28,C1666544295,21249.00,19384.72,M2044282225,0.00,0.00,0,0
2,1,TRANSFER,181.00,C1305486145,181.00,0.00,C553264065,0.00,0.00,1,0
3,1,CASH_OUT,181.00,C840083671,181.00,0.00,C38997010,21182.00,0.00,1,0
4,1,PAYMENT,11668.14,C2048537720,41554.00,29885.86,M1230701703,0.00,0.00,0,0
...,...,...,...,...,...,...,...,...,...,...,...
6362615,743,CASH_OUT,339682.13,C786484425,339682.13,0.00,C776919290,0.00,339682.13,1,0
6362616,743,TRANSFER,6311409.28,C1529008245,6311409.28,0.00,C1881841831,0.00,0.00,1,0
6362617,743,CASH_OUT,6311409.28,C1162922333,6311409.28,0.00,C1365125890,68488.84,6379898.11,1,0
6362618,743,TRANSFER,850002.52,C1685995037,850002.52,0.00,C2080388513,0.00,0.00,1,0
6362619,743,CASH_OUT,850002.52,C1280323807,850002.52,0.00,C873221189,6510099.11,7360101.63,1,0

In [257]:
#fillna function  for numerical values
mis = round(df['amount'].mean(),2)
df['amount'].fillna(mis)

0             9839.64
1             1864.28
2              181.00
3              181.00
4            11668.14
              ...
6362615     339682.13
6362616    6311409.28
6362617    6311409.28
6362618     850002.52
6362619     850002.52
Name: amount, Length: 6362620, dtype: float64

In [280]:
#fillna for categorical values
df['type'] = df['type'].fillna(df['type'].mode())

In [282]:
df.isnull().sum()

step              0
type              0
amount            0
nameOrig          0
oldbalanceOrg     0
newbalanceOrig    0
nameDest          0
oldbalanceDest    0
newbalanceDest    0
isFraud           0
isFlaggedFraud    0
dtype: int64

In [286]:
#Sample function
df.sample(10) #get random sample

,step,type,amount,nameOrig,oldbalanceOrg,newbalanceOrig,nameDest,oldbalanceDest,newbalanceDest,isFraud,isFlaggedFraud
516637,20,CASH_IN,126679.78,C1594218772,50641.00,177320.78,C940753778,16310.32,0.00,0,0
1286272,135,CASH_OUT,266857.18,C1387949787,131.00,0.00,C409060521,4276615.37,4543472.55,0,0
2377527,192,CASH_OUT,50477.52,C316163364,0.00,0.00,C1183140080,144353.66,194831.18,0,0
2016177,180,PAYMENT,4444.33,C1463860191,4653.08,208.75,M249036771,0.00,0.00,0,0
4343048,308,PAYMENT,9323.99,C1707311904,24178.00,14854.01,M1689307656,0.00,0.00,0,0
1455970,140,PAYMENT,924.16,C913564413,0.00,0.00,M1376490514,0.00,0.00,0,0
510715,20,PAYMENT,10391.43,C87928599,0.00,0.00,M321598779,0.00,0.00,0,0
1992302,179,CASH_IN,345787.60,C1417777466,162800.68,508588.28,C578052929,1508195.46,1162407.87,0,0
4155627,303,CASH_IN,286166.03,C1629706625,383978.00,670144.03,C934576741,469952.68,183786.65,0,0
2545911,206,PAYMENT,1196.63,C722293967,217273.18,216076.55,M1222372928,0.00,0.00,0,0

In [288]:
data = {'One' : pd.Series([1,2,3,4]),
        'Two' : pd.Series([10,20,30,40]),
        'Three' : pd.Series([100,200,300,400]),
        'Four' : pd.Series([1000,2000,3000,4000])}
df = pd.DataFrame(data)
print(df)

   One  Two  Three  Four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [290]:
df.to_csv("Numbers.csv")

In [292]:
df = pd.read_csv("Numbers.csv")
df

   Unnamed: 0  One  Two  Three  Four
0           0    1   10    100  1000
1           1    2   20    200  2000
2           2    3   30    300  3000
3           3    4   40    400  4000

***A details Pandas Profile report***

In [313]:
!pip install pandas_profiling

Requirement already satisfied: pandas_profiling in c:\users\chand\anaconda3\lib\site-packages (3.2.0)
Requirement already satisfied: joblib~=1.1.0 in c:\users\chand\anaconda3\lib\site-packages (from pandas_profiling) (1.1.1)
Requirement already satisfied: scipy>=1.4.1 in c:\users\chand\appdata\roaming\python\python312\site-packages (from pandas_profiling) (1.14.1)
Requirement already satisfied: pandas!=1.0.0,!=1.0.1,!=1.0.2,!=1.1.0,>=0.25.3 in c:\users\chand\appdata\roaming\python\python312\site-packages (from pandas_profiling) (2.2.3)
Requirement already satisfied: matplotlib>=3.2.0 in c:\users\chand\appdata\roaming\python\python312\site-packages (from pandas_profiling) (3.9.2)
Requirement already satisfied: pydantic>=1.8.1 in c:\users\chand\appdata\roaming\python\python312\site-packages (from pandas_profiling) (2.9.2)
Requirement already satisfied: PyYAML>=5.0.0 in c:\users\chand\appdata\roaming\python\python312\site-packages (from pandas_profiling) (6.0.2)
Requirement already satisfied: jinja2>=2.11.1 in c:\users\chand\appdata\roaming\python\python312\site-packages (from pandas_profiling) (3.1.4)
Requirement already satisfied: markupsafe~=2.1.1 in c:\users\chand\appdata\roaming\python\python312\site-packages (from pandas_profiling) (2.1.5)
Requirement already satisfied: visions==0.7.4 in c:\users\chand\anaconda3\lib\site-packages (from visions[type_image_path]==0.7.4->pandas_profiling) (0.7.4)
Requirement already satisfied: numpy>=1.16.0 in c:\users\chand\appdata\roaming\python\python312\site-packages (from pandas_profiling) (1.26.4)
Requirement already satisfied: htmlmin>=0.1.12 in c:\users\chand\anaconda3\lib\site-packages (from pandas_profiling) (0.1.12)
Requirement already satisfied: missingno>=0.4.2 in c:\users\chand\anaconda3\lib\site-packages (from pandas_profiling) (0.5.2)
Requirement already satisfied: phik>=0.11.1 in c:\users\chand\anaconda3\lib\site-packages (from pandas_profiling) (0.12.4)
Requirement already satisfied: tangled-up-in-unicode==0.2.0 in c:\users\chand\anaconda3\lib\site-packages (from pandas_profiling) (0.2.0)
Requirement already satisfied: requests>=2.24.0 in c:\users\chand\appdata\roaming\python\python312\site-packages (from pandas_profiling) (2.32.3)
Requirement already satisfied: tqdm>=4.48.2 in c:\users\chand\appdata\roaming\python\python312\site-packages (from pandas_profiling) (4.66.5)
Requirement already satisfied: seaborn>=0.10.1 in c:\users\chand\anaconda3\lib\site-packages (from pandas_profiling) (0.13.2)
Requirement already satisfied: multimethod>=1.4 in c:\users\chand\anaconda3\lib\site-packages (from pandas_profiling) (1.12)
Requirement already satisfied: attrs>=19.3.0 in c:\users\chand\appdata\roaming\python\python312\site-packages (from visions==0.7.4->visions[type_image_path]==0.7.4->pandas_profiling) (24.2.0)
Requirement already satisfied: networkx>=2.4 in c:\users\chand\appdata\roaming\python\python312\site-packages (from visions==0.7.4->visions[type_image_path]==0.7.4->pandas_profiling) (3.3)
Requirement already satisfied: imagehash in c:\users\chand\anaconda3\lib\site-packages (from visions[type_image_path]==0.7.4->pandas_profiling) (4.3.1)
Requirement already satisfied: Pillow in c:\users\chand\appdata\roaming\python\python312\site-packages (from visions[type_image_path]==0.7.4->pandas_profiling) (10.4.0)
Requirement already satisfied: contourpy>=1.0.1 in c:\users\chand\appdata\roaming\python\python312\site-packages (from matplotlib>=3.2.0->pandas_profiling) (1.3.0)
Requirement already satisfied: cycler>=0.10 in c:\users\chand\appdata\roaming\python\python312\site-packages (from matplotlib>=3.2.0->pandas_profiling) (0.12.1)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\chand\appdata\roaming\python\python312\site-packages (from matplotlib>=3.2.0->pandas_profiling) (4.53.1)
Requirement already satisfied: kiwisolver>=1.3.1 in c:\users\chand\appdata\roaming\python\python312\site-packages (from matplotlib>=3.2.0->pandas_profiling) (1.4.5)
Requirement already satisfied: packaging>=20.0 in c:\users\chand\appdata\roaming\python\python312\site-packages (from matplotlib>=3.2.0->pandas_profiling) (24.1)
Requirement already satisfied: pyparsing>=2.3.1 in c:\users\chand\appdata\roaming\python\python312\site-packages (from matplotlib>=3.2.0->pandas_profiling) (3.1.4)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\chand\appdata\roaming\python\python312\site-packages (from matplotlib>=3.2.0->pandas_profiling) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\chand\appdata\roaming\python\python312\site-packages (from pandas!=1.0.0,!=1.0.1,!=1.0.2,!=1.1.0,>=0.25.3->pandas_profiling) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\chand\appdata\roaming\python\python312\site-packages (from pandas!=1.0.0,!=1.0.1,!=1.0.2,!=1.1.0,>=0.25.3->pandas_profiling) (2024.1)
Requirement already satisfied: annotated-types>=0.6.0 in c:\users\chand\appdata\roaming\python\python312\site-packages (from pydantic>=1.8.1->pandas_profiling) (0.7.0)
Requirement already satisfied: pydantic-core==2.23.4 in c:\users\chand\appdata\roaming\python\python312\site-packages (from pydantic>=1.8.1->pandas_profiling) (2.23.4)
Requirement already satisfied: typing-extensions>=4.6.1 in c:\users\chand\appdata\roaming\python\python312\site-packages (from pydantic>=1.8.1->pandas_profiling) (4.12.2)
Requirement already satisfied: charset-normalizer<4,>=2 in c:\users\chand\appdata\roaming\python\python312\site-packages (from requests>=2.24.0->pandas_profiling) (3.3.2)
Requirement already satisfied: idna<4,>=2.5 in c:\users\chand\appdata\roaming\python\python312\site-packages (from requests>=2.24.0->pandas_profiling) (3.8)
Requirement already satisfied: urllib3<3,>=1.21.1 in c:\users\chand\appdata\roaming\python\python312\site-packages (from requests>=2.24.0->pandas_profiling) (2.2.2)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\chand\appdata\roaming\python\python312\site-packages (from requests>=2.24.0->pandas_profiling) (2024.7.4)
Requirement already satisfied: colorama in c:\users\chand\appdata\roaming\python\python312\site-packages (from tqdm>=4.48.2->pandas_profiling) (0.4.6)
Requirement already satisfied: six>=1.5 in c:\users\chand\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.7->matplotlib>=3.2.0->pandas_profiling) (1.16.0)
Requirement already satisfied: PyWavelets in c:\users\chand\anaconda3\lib\site-packages (from imagehash->visions[type_image_path]==0.7.4->pandas_profiling) (1.5.0)

In [315]:
import matplotlib

In [321]:
#import pandas_profiling as pp